"""Снабди каждый комментарий правильной командой."""

python3 -V  # команда для проверки текущей версии Питона
/usr/bin/python; python # запуск интерпретатора Питона в режиме REPL
python -m venv env # создание виртуального окружения в текущей директории
source env/bin/activate # активация вышесозданного виртуального окружения
deactivate # деактивация виртуального окружения
python run.py # запуск скрипта run.py находящегося в текущей директории
pip install requests # установка пакета requests через пакетный менеджер pip
